Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/money_matters_after_a_death/index.html.txt.tmx
Source language: en
Languages: ga

source: Money matters after a death
ga: Cúrsaí airgid tar éis báis

source: Overview Document Money matters after a death When someone close to you dies there are many things that have to be decided and done at a time of considerable stress
ga: Overview Document Ábhair airgid i ndiaidh an bháis Nuair a fhaigheann do chéile nó garghaol bás, bíonn a lán le déanamh agat agus bíonn ort a lán cinntí a dhéanamh agus tú faoi mhórstrus

source: Overview of issues such as social welfare entitlements, tax and other money matters that may need to be addressed
ga: Achoimre ar shaincheisteanna, m.sh. teidlíochtaí leasa shóisialaigh, cáin agus ábhair airgid eile gur gá dul i gceann orthu

source: Access to money after a death
ga: Rochtain ar airgead i ndiaidh an bháis

source: It is not easy to get immediate access to a deceased person's money in Ireland unless it is in a joint account
ga: Níl sé éasca airgead duine éagtha a rochtain ar an bpointe in Éirinn, ach amháin i gcás comh-chuntais

source: Find out more here
ga: Cliceáil anseo chun breis faisnéise a fháil

source: Financial assistance following a bereavement
ga: Cúnamh airgeadais tar éis báis

source: Supports are available in Ireland to help families following a bereavement. Describes certain once-off Health Service Executive (HSE) Area and social welfare payments. Find out how to apply
ga: Cur síos ar na rialacha agus modhanna iarratais a bhaineann le íocaíochtaí gearghá taréis báis ( áit a gcaithfidh géarghá a bheith ag an iarrathóir nó gan mórán nó gan aon mhaoin a bheith aige/ aici)

source: Benefits and entitlements following a death
ga: Sochair agus teidlíochta tar éis báis

source: An overview of the different social welfare benefits available when someone dies
ga: Soláthraíonn an doiciméad seo forbhreathnú ar na sochair leasa shóisialaigh atá ar fáil nuair a fhaigheann duine bás

source: This document is in: Social Welfare > Social welfare payments > Death related benefits
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Sochair a Bhaineann le Bás

source: Widow's, Widower's or Surviving Civil Partner’s (Non-Contributory) Pension
ga: Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: The Widow's, Widower's or Surviving Civil Partner’s Non-Contributory Pension is payable to widowed people or surviving civil partners without dependent children who do not qualify for a contributory pension and who pass a means test
ga: Cur síos ar an Phinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach) a íoctar do dhaoine ar baintreach nó páirtnéirí sibhialta marthanacha siúd nach bhfuil i dteideal pinsean ranníocaíochta agus a éiríonn leo sa scrúdú maoine

source: Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: A Widow's, Widower's or Surviving Civil Partner's contributory pension and related social welfare benefits may be payable if either the deceased person or their spouse/civil partner has enough PRSI contributions
ga: Má tá dóthain ranníocaíochtaí ÁSPC ag an té atá básaithe nó an chéile, d'fhéadfadh an Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) a bheith íoctha chomh maith le sochair leasa shóisialaigh atá bainteach

source: A guardian's payment or Orphan's Pension may be made to a person taking care of an orphan. In some cases it can be paid directly to the orphan
ga: D'fhéadfadh íocaíocht caomhnóra nó pinsean do dhílleachtaí bheith íoctha don duine atá ag tabhairt cúram do dhílleachta

source: Death Benefits under the Occupational Injuries Scheme
ga: Sochair Bháis faoin Scéim um Shochair Dhíobhálacha Ceirde

source: Information about Death Benefits under the Occupational Injuries Scheme
ga: Faisnéis faoi Shochair Bháis faoin Scéim um Shochair Dhíobhálacha Ceirde

source: Income tax credits and reliefs following a death
ga: Creidmheasanna agus faoiseamh cánach ioncaim tar éis báis

source: A brief summary of the tax treatment of unmarried and widowed people in the year of death
ga: Réamhrá gairid den cháin a ghearrtar ar daoine nach bhfuil pósta agus daoine ar baintreacha/baintreacha fir iad sa bhliain a fhaigheann duine den lánúin bás

source: An outline of tax treatment of married couples in the year of death of one spouse is also included
ga: Tá cuntas san áireamh ar an gcaoi a gcaitear ó thaobh cáin de le lánúin phósta sa bhliain a fhaigheann duine den lánúin bás

source: This document is in: Money and Tax > Tax > Income tax credits and reliefs
ga: This document is in: Airgead agus Cáin > Cáin > Creidmheasanna agus faoiseamh cáin ioncaim

source: If you receive a gift, you may have to pay gift tax on it
ga: Má fhaigheann tú bronntanas, b'fhéidir go mbeidh Cáin Bhronntanais le n-íoc agat air

source: If you receive an inheritance following a death, it may be liable to inheritance tax
ga: Má fhaigheann tú oidhreacht tar éis báis, b'fhéidir go mbeidh Cáin Oidhreachta le gearradh air

source: Both these taxes are types of Capital Acquisitions Tax
ga: Is cineálacha Cánach Fháltais Caipitiúil iad an dá cháin seo

source: This document is in: Money and Tax > Tax > Capital taxes
ga: This document is in: Airgead agus Cáin > Cáin > Cánacha Caipitil

source: Most Read in "Death and Bereavement"
ga: Ábhar is mó éilimh i "Bás agus Méala"

source: Dealing with the deceased's estate
ga: Deileáil le hEastát an Mhairbh
